[
  {
    "id": "job-001",
    "title": "Software Engineer, Platform",
    "company": "Aster Labs",
    "location": "San Francisco, CA",
    "experience": "Mid-Level",
    "employmentType": "Full-Time",
    "salary": "$120,000 - $150,000",
    "remote": false,
    "visaTypes": ["H-1B", "L-1"],
    "shortDescription": "Build scalable backend services powering our core platform.",
    "description": "At Aster Labs, we are building a cutting-edge platform that supports some of the most complex distributed systems and applications. As a Software Engineer on the Platform team, you will work closely with cross-functional teams to design and implement robust backend services that power our core platform, serving millions of users worldwide. You will have the opportunity to grow your skills by working on a highly scalable infrastructure and help improve the performance of our backend systems. If you're excited about distributed systems and cloud technologies, this is your chance to make a tangible impact on a rapidly growing tech company.",
    "responsibilities": "Design, build, and maintain highly scalable and reliable backend services; collaborate with cross-functional teams, including product, infrastructure, and data engineering teams; contribute to improving the performance, reliability, and scalability of the platform; participate in design reviews and provide feedback on architecture decisions; mentor junior engineers and promote best practices in software engineering; troubleshoot production issues and provide timely solutions to maintain uptime.",
    "qualifications": "3+ years of experience in backend software development; expertise in cloud technologies and microservices architecture; proficiency in one or more backend programming languages (e.g., Java, Go, Python); experience working with databases, message queues, and distributed systems; knowledge of containerization technologies like Docker and Kubernetes; familiarity with AWS or Google Cloud services; strong debugging skills and the ability to solve complex technical problems.",
    "additionalInfo": "Aster Labs is an exciting place to grow your career with ample opportunities to work on innovative technologies. You’ll be part of a high-performing, collaborative team that values innovation, teamwork, and continuous learning. We support a healthy work-life balance and encourage personal and professional development. You may be required to join an on-call rotation for production support as part of the role.",
    "postedDate": "2025-10-01"
  },
  {
    "id": "job-002",
    "title": "Product Designer",
    "company": "BluePeak",
    "location": "New York, NY",
    "experience": "Entry-Level",
    "employmentType": "Full-Time",
    "salary": "$70,000 - $90,000",
    "remote": true,
    "visaTypes": ["H-1B"],
    "shortDescription": "Design intuitive user experiences for our core web product.",
    "description": "At BluePeak, we are passionate about delivering exceptional, user-centered designs for our web products. As a Product Designer, you will have the opportunity to influence the design direction of our flagship product while collaborating with a team of designers, product managers, and engineers. This role involves running user research, prototyping new features, and collaborating with cross-functional teams to ensure that our product is both functional and delightful to use. You'll have the chance to contribute to the product’s overall look and feel while learning from seasoned designers and gaining exposure to various aspects of design thinking.",
    "responsibilities": "Collaborate with product managers, engineers, and other designers to define and prioritize user needs; create wireframes, prototypes, and high-fidelity designs for new features; conduct user research, usability testing, and iterate based on feedback; ensure design consistency across the product; contribute to the design system and help define and maintain design standards; assist with design critiques and provide feedback to peers; communicate design ideas effectively to both technical and non-technical stakeholders.",
    "qualifications": "A strong portfolio that demonstrates your proficiency in visual design and interaction design; familiarity with design tools such as Figma, Sketch, and InVision; experience with user-centered design and a basic understanding of design systems; excellent communication skills and the ability to collaborate with teams; eagerness to learn and improve your design skills in a fast-paced environment.",
    "additionalInfo": "BluePeak offers a flexible, fully remote work environment with opportunities for growth. You’ll be joining a tight-knit, highly collaborative design team where mentorship is a key part of our culture. Whether you are looking to grow your skills or expand your experience, BluePeak offers the resources and guidance to help you advance.",
    "postedDate": "2025-09-18"
  },
  {
    "id": "job-003",
    "title": "Data Scientist",
    "company": "Cortex Analytics",
    "location": "Seattle, WA",
    "experience": "Mid-Level",
    "employmentType": "Full-Time",
    "salary": "$110,000 - $140,000",
    "remote": false,
    "visaTypes": ["H-1B", "O-1"],
    "shortDescription": "Develop models to extract insights from large datasets.",
    "description": "As a Data Scientist at Cortex Analytics, you will play a key role in leveraging data to help our clients make informed, data-driven decisions. This role involves developing predictive models, improving existing algorithms, and collaborating with data engineers to ensure high-quality data pipelines. You will work with both internal teams and clients to deliver actionable insights and ensure that our data solutions align with business goals. If you are passionate about working with large datasets and solving complex analytical problems, this is an excellent opportunity for you.",
    "responsibilities": "Develop and optimize machine learning models to drive insights from large datasets; collaborate with data engineers to improve data quality and enhance data pipelines; work closely with product teams to align analytical solutions with business needs; communicate findings through compelling data visualizations and reports; participate in code reviews and mentoring junior data scientists; contribute to the continuous improvement of data science best practices within the company.",
    "qualifications": "Strong experience with Python and data analysis libraries (e.g., Pandas, Scikit-learn, TensorFlow); hands-on experience with SQL and data wrangling; strong background in statistics, machine learning, and predictive modeling; ability to communicate complex insights to non-technical stakeholders; familiarity with cloud platforms like AWS or GCP; experience with data visualization tools (e.g., Tableau, PowerBI) is a plus.",
    "additionalInfo": "At Cortex Analytics, we are committed to fostering an inclusive and collaborative environment. You will be joining a team of passionate data scientists who are eager to share knowledge and support each other's professional growth. We offer opportunities to work on cutting-edge analytics projects and give you the tools to continuously learn and improve.",
    "postedDate": "2025-10-10"
  },
  {
    "id": "job-004",
    "title": "Frontend Engineer",
    "company": "DeltaWorks",
    "location": "Austin, TX",
    "experience": "Senior-Level",
    "employmentType": "Full-Time",
    "salary": "$130,000 - $160,000",
    "remote": true,
    "visaTypes": ["H-1B"],
    "shortDescription": "Create responsive, accessible web interfaces.",
    "description": "DeltaWorks is seeking a talented Senior Frontend Engineer to join our team and lead the development of scalable, performant, and accessible web applications. You will be responsible for optimizing frontend performance and ensuring accessibility compliance across all of our digital products. In this role, you will collaborate with designers, backend engineers, and product managers to ensure the seamless implementation of new features. Your expertise in frontend technologies and passion for delivering exceptional user experiences will be key in driving the success of our products.",
    "responsibilities": "Lead the design and implementation of frontend systems that deliver optimal user experiences across devices; optimize web applications for maximum speed and scalability; work closely with the product team to translate business requirements into technical solutions; enforce accessibility standards and guidelines across products to ensure compliance with WCAG; mentor junior engineers and assist with career development; promote frontend best practices and help drive innovation across the team.",
    "qualifications": "Strong expertise in JavaScript and React; solid experience with HTML5, CSS3, and modern frontend development practices; deep understanding of performance optimization and scalability; experience with automated testing frameworks (e.g., Jest, Cypress); familiarity with accessibility standards and tools like Axe and Lighthouse; experience working in agile environments and collaborating with cross-functional teams.",
    "additionalInfo": "At DeltaWorks, we value innovation and collaboration. This is a fully remote position, allowing you to work flexibly while contributing to a diverse and supportive team. DeltaWorks is committed to investing in your personal growth, with opportunities for mentorship, training, and leadership development.",
    "postedDate": "2025-09-30"
  },
  {
    "id": "job-005",
    "title": "Marketing Coordinator",
    "company": "Evergreen Media",
    "location": "Remote",
    "experience": "Entry-Level",
    "employmentType": "Part-Time",
    "salary": "$40/hr",
    "remote": true,
    "visaTypes": ["OPT"],
    "shortDescription": "Support marketing campaigns and content creation.",
    "description": "Evergreen Media is seeking a Marketing Coordinator to assist in executing marketing campaigns and content creation. This remote, part-time role will provide hands-on experience with digital marketing strategies, social media campaigns, and content planning. As a Marketing Coordinator, you will collaborate closely with the marketing team to help grow brand presence, track campaign performance, and create content for social media platforms and websites.",
    "responsibilities": "Assist in the planning and execution of digital marketing campaigns across various channels (social media, email, SEO); create engaging social media posts, blog content, and newsletters; track and report on campaign performance using analytics tools; collaborate with designers and copywriters to create compelling content; stay up-to-date with industry trends and suggest new marketing initiatives.",
    "qualifications": "Strong written and verbal communication skills; familiarity with social media platforms and content management tools (e.g., Hootsuite, Buffer, WordPress); basic understanding of analytics tools (e.g., Google Analytics, Social Media Insights); ability to manage multiple tasks and work independently in a remote environment; positive attitude and willingness to learn.",
    "additionalInfo": "This role is perfect for students or recent graduates looking to gain hands-on marketing experience. Evergreen Media offers flexible work hours and a supportive, collaborative team environment. The position is ideal for individuals on OPT and offers the potential for growth within the marketing department.",
    "postedDate": "2025-10-12"
  },
  {
    "id": "job-006",
    "title": "DevOps Engineer",
    "company": "Flux Infrastructure",
    "location": "Boston, MA",
    "experience": "Mid-Level",
    "employmentType": "Full-Time",
    "salary": "$115,000 - $140,000",
    "remote": false,
    "visaTypes": ["H-1B", "L-1"],
    "shortDescription": "Improve CI/CD and cloud reliability.",
    "description": "As a DevOps Engineer at Flux Infrastructure, you’ll play a crucial role in improving the reliability of our cloud infrastructure and automation workflows. You will collaborate with software engineers to improve our continuous integration and continuous deployment (CI/CD) pipelines. Additionally, you’ll be working to automate cloud infrastructure, improve monitoring, and ensure we are scaling efficiently. If you are passionate about DevOps practices and cloud technologies, this is the role for you.",
    "responsibilities": "Automate and improve CI/CD pipelines; work closely with engineering teams to ensure smooth deployments; develop scripts and automation tools for infrastructure provisioning; monitor system performance and help optimize cloud resources; collaborate with product and engineering teams to identify and solve infrastructure bottlenecks; create and maintain infrastructure-as-code solutions using tools like Terraform and CloudFormation.",
    "qualifications": "Experience with CI/CD tools (e.g., Jenkins, GitLab CI, CircleCI); strong knowledge of cloud platforms (AWS, GCP, Azure) and infrastructure automation tools (e.g., Terraform, Ansible); experience with containerization technologies such as Docker and Kubernetes; familiarity with monitoring and logging systems (e.g., Prometheus, Grafana, ELK stack); ability to write scripts in Python, Bash, or similar languages.",
    "additionalInfo": "This role requires being on-call for production issues, but offers a flexible and collaborative work environment. You will be working with a team that values continuous improvement and embraces modern DevOps practices to deliver robust, scalable services.",
    "postedDate": "2025-10-03"
  },
  {
    "id": "job-007",
    "title": "Mobile Engineer (iOS)",
    "company": "Greenfield Apps",
    "location": "San Diego, CA",
    "experience": "Mid-Level",
    "employmentType": "Full-Time",
    "salary": "$120,000 - $145,000",
    "remote": false,
    "visaTypes": ["H-1B"],
    "shortDescription": "Ship delightful iOS experiences using Swift.",
    "description": "Greenfield Apps is looking for an experienced iOS Engineer to join our team. In this role, you’ll be developing iOS apps with a strong focus on delivering exceptional user experiences. You will collaborate with product managers, designers, and other engineers to build features, optimize performance, and ensure the highest quality standards for our mobile products. If you are passionate about mobile app development and have experience with Swift, we want to hear from you.",
    "responsibilities": "Implement features in Swift and ensure high performance and quality; collaborate with designers to implement pixel-perfect UI; write unit tests to ensure code quality and maintainability; participate in code reviews and mentor junior engineers; maintain knowledge of industry trends and emerging iOS technologies; contribute to architecture decisions to ensure the scalability and performance of the app.",
    "qualifications": "3+ years of experience with iOS development using Swift; deep knowledge of iOS frameworks like UIKit and SwiftUI; familiarity with app lifecycle, networking, and data management in iOS; experience with Git, CI/CD workflows, and testing frameworks; strong problem-solving skills and ability to troubleshoot complex issues.",
    "additionalInfo": "Experience with mobile CI/CD tools and large-scale mobile app deployments is a plus. You'll be part of a fast-paced team with the opportunity to innovate and shape the direction of mobile products at Greenfield Apps.",
    "postedDate": "2025-09-25"
  },
  {
    "id": "job-008",
    "title": "Customer Success Manager",
    "company": "Halo Systems",
    "location": "Chicago, IL",
    "experience": "Mid-Level",
    "employmentType": "Full-Time",
    "salary": "$75,000 - $95,000",
    "remote": true,
    "visaTypes": ["H-1B", "OPT"],
    "shortDescription": "Drive product adoption and customer outcomes.",
    "description": "Halo Systems is seeking a motivated and customer-focused Customer Success Manager to join our team. In this role, you will help onboard customers, build strong relationships, and ensure that customers are successful with our product. You will work closely with customers to understand their needs, drive product adoption, and ensure that they are able to achieve their desired outcomes. You’ll collaborate with the product and engineering teams to provide feedback and improve the customer experience.",
    "responsibilities": "Manage customer relationships and provide onboarding and training sessions; work with customers to ensure they realize the full value of Halo Systems' products; drive customer success metrics such as retention, expansion, and satisfaction; collaborate with sales, product, and engineering teams to identify and address customer needs and challenges; act as a liaison between the customer and internal teams to improve product offerings and features.",
    "qualifications": "Experience in customer success or client-facing roles; strong communication skills, both written and verbal; problem-solving mindset and ability to manage customer expectations effectively; experience with CRM tools (e.g., Salesforce) and customer success platforms; technical aptitude to understand the product and guide customers through complex technical features.",
    "additionalInfo": "This is a remote-friendly role with occasional travel. You will work in a collaborative, customer-centric environment with a focus on growth and helping customers succeed. Halo Systems offers excellent benefits, including health insurance, a retirement plan, and professional development opportunities.",
    "postedDate": "2025-10-05"
  },
  {
    "id": "job-009",
    "title": "QA Engineer",
    "company": "Ionix QA",
    "location": "Denver, CO",
    "experience": "Entry-Level",
    "employmentType": "Full-Time",
    "salary": "$65,000 - $80,000",
    "remote": false,
    "visaTypes": ["H-1B"],
    "shortDescription": "Validate product quality through automated tests.",
    "description": "Ionix QA is looking for a Quality Assurance Engineer to join our team and help ensure the quality of our products through automated testing. In this role, you will be responsible for developing automated test cases, running tests, and identifying defects early in the development lifecycle. You'll work closely with the engineering team to ensure that our products meet the highest quality standards and are ready for production.",
    "responsibilities": "Develop and maintain automated test suites; collaborate with engineers to identify testing requirements and edge cases; integrate tests into the CI/CD pipeline; create and maintain test documentation and reports; work with the engineering team to identify and fix defects; continuously improve the test process to ensure efficiency and effectiveness.",
    "qualifications": "Experience with automated testing frameworks such as Selenium or Cypress; familiarity with CI/CD tools and test automation integration; strong attention to detail and ability to identify issues in complex systems; familiarity with web applications and mobile apps; good communication skills and ability to collaborate effectively with engineering teams.",
    "additionalInfo": "This is an opportunity to grow into a full-fledged SDET role. Ionix QA offers career development opportunities and a supportive team environment.",
    "postedDate": "2025-10-08"
  },
  {
    "id": "job-010",
    "title": "Research Analyst",
    "company": "Kite Insights",
    "location": "Philadelphia, PA",
    "experience": "Mid-Level",
    "employmentType": "Contract",
    "salary": "$50/hr",
    "remote": true,
    "visaTypes": ["OPT", "CPT"],
    "shortDescription": "Conduct market research and competitive analysis.",
    "description": "Kite Insights is looking for a skilled Research Analyst to join our team on a contract basis. In this role, you will conduct primary and secondary research to generate actionable insights for our clients. You will analyze industry trends, competitor strategies, and customer needs to support business decisions and help guide the company's product strategy. If you have a strong research background and an interest in competitive analysis, this is an exciting opportunity for you.",
    "responsibilities": "Conduct both qualitative and quantitative research; collect and synthesize data from primary and secondary sources; create detailed reports and presentations to communicate findings to internal teams and clients; identify market trends and opportunities for growth; analyze competitor strategies and provide actionable insights.",
    "qualifications": "Strong research and analytical skills; experience with market research methodologies and tools; excellent writing and presentation skills; ability to analyze complex data and identify actionable insights; experience in competitive analysis and business strategy is a plus.",
    "additionalInfo": "This is a contract role with the potential for extension based on project needs. Kite Insights values diversity and offers flexible work arrangements.",
    "postedDate": "2025-09-20"
  },
  {
    "id": "job-011",
    "title": "Backend Engineer (Go)",
    "company": "LambdaWorks",
    "location": "Raleigh, NC",
    "experience": "Senior-Level",
    "employmentType": "Full-Time",
    "salary": "$140,000 - $170,000",
    "remote": false,
    "visaTypes": ["H-1B", "L-1"],
    "shortDescription": "Design microservices and high-performance APIs.",
    "description": "LambdaWorks is looking for an experienced Backend Engineer to join our team and focus on designing and optimizing microservices using Go. You will be responsible for building scalable, high-performance APIs that serve as the backbone for our product. As a senior-level engineer, you will mentor junior engineers, review code, and make key decisions on the architecture and performance of the system.",
    "responsibilities": "Design and build high-performance APIs and microservices; optimize backend performance and scalability; lead the design and implementation of new features; mentor junior engineers and promote best practices; collaborate with frontend engineers to ensure seamless integration of the API with the frontend.",
    "qualifications": "Extensive experience with Go and microservices architecture; strong knowledge of distributed systems and cloud platforms; experience with database design, caching strategies, and performance tuning; experience with containerization technologies such as Docker and Kubernetes; ability to mentor junior engineers and lead technical initiatives.",
    "additionalInfo": "LambdaWorks offers a collaborative and innovative environment, with opportunities to work on high-impact projects and lead technical initiatives. We value continuous learning and support professional growth.",
    "postedDate": "2025-10-07"
  },
  {
    "id": "job-012",
    "title": "HR Generalist",
    "company": "Nova HR",
    "location": "Portland, OR",
    "experience": "Mid-Level",
    "employmentType": "Full-Time",
    "salary": "$70,000 - $85,000",
    "remote": false,
    "visaTypes": ["H-1B", "OPT"],
    "shortDescription": "Support HR operations and recruitment.",
    "description": "Nova HR is seeking an HR Generalist to join our growing team. You will assist in all aspects of HR, including recruitment, onboarding, employee relations, and benefits administration. This is a great opportunity for someone who enjoys a diverse set of HR responsibilities and wants to make an impact in a fast-paced environment.",
    "responsibilities": "Assist with recruitment and hiring processes; coordinate employee onboarding and training; support employee relations and conflict resolution; help administer benefits programs; maintain HRIS data and ensure compliance with labor laws; assist in performance management processes and employee engagement initiatives.",
    "qualifications": "Experience in HR operations, recruitment, and employee relations; familiarity with HRIS systems and MS Office Suite; strong communication and organizational skills; ability to handle sensitive information with discretion; knowledge of labor laws and compliance requirements.",
    "additionalInfo": "This role offers growth opportunities within the HR field and a collaborative environment. Nova HR supports professional development and a healthy work-life balance.",
    "postedDate": "2025-09-28"
  },
  {
    "id": "job-013",
    "title": "Technical Writer",
    "company": "Orbit Docs",
    "location": "Remote",
    "experience": "Entry-Level",
    "employmentType": "Contract",
    "salary": "$45/hr",
    "remote": true,
    "visaTypes": ["OPT"],
    "shortDescription": "Create clear developer documentation and guides.",
    "description": "Orbit Docs is looking for a Technical Writer to join our team on a contract basis. In this role, you will work with engineers to create clear, concise, and user-friendly documentation for our APIs, software tools, and internal processes. You will help developers understand our platform by translating complex technical information into accessible content.",
    "responsibilities": "Collaborate with engineers to document APIs, processes, and technical workflows; create how-to guides, tutorials, and user manuals; ensure technical accuracy and clarity in documentation; maintain and update existing documentation; ensure documentation adheres to company style and standards.",
    "qualifications": "Strong writing and editing skills; ability to translate complex technical concepts into easy-to-understand language; familiarity with API documentation tools (e.g., Swagger, Postman); basic understanding of software development processes; ability to work independently and meet deadlines.",
    "additionalInfo": "This is a remote, flexible contract role. Orbit Docs offers an opportunity to work with a growing company and gain exposure to various technical fields. We encourage creativity and support continuous learning.",
    "postedDate": "2025-10-11"
  },
  {
    "id": "job-014",
    "title": "Data Engineer",
    "company": "Pioneer Data",
    "location": "Atlanta, GA",
    "experience": "Mid-Level",
    "employmentType": "Full-Time",
    "salary": "$115,000 - $140,000",
    "remote": false,
    "visaTypes": ["H-1B"],
    "shortDescription": "Build and maintain ETL pipelines.",
    "description": "Pioneer Data is looking for a skilled Data Engineer to design, build, and maintain data pipelines that support our analytics and machine learning workloads. You will work closely with data scientists and analysts to ensure that data is properly structured and easily accessible for analysis. Your contributions will help optimize data workflows and improve data-driven decision-making across the company.",
    "responsibilities": "Design and implement ETL pipelines to support analytics and machine learning tasks; optimize and maintain data processing systems for scalability and efficiency; collaborate with data scientists and analysts to understand data needs and requirements; ensure data quality and consistency across platforms; monitor and troubleshoot data pipelines to ensure smooth operations.",
    "qualifications": "Experience with ETL tools and frameworks (e.g., Apache Spark, Airflow); proficiency in SQL and data modeling; experience with cloud data platforms (AWS, GCP, or Azure); strong problem-solving skills and attention to detail; familiarity with Python or other scripting languages for data processing.",
    "additionalInfo": "Pioneer Data is a forward-thinking company that offers ample opportunities for growth in the data engineering field. We foster a collaborative work environment and are committed to providing continuous learning opportunities.",
    "postedDate": "2025-10-02"
  },
  {
    "id": "job-015",
    "title": "UX Researcher",
    "company": "Quanta Labs",
    "location": "Los Angeles, CA",
    "experience": "Mid-Level",
    "employmentType": "Full-Time",
    "salary": "$95,000 - $115,000",
    "remote": true,
    "visaTypes": ["H-1B", "OPT"],
    "shortDescription": "Lead user research and testing efforts.",
    "description": "Quanta Labs is seeking a UX Researcher to join our team and lead user research and testing efforts to inform product decisions. You will conduct user studies, usability tests, and interviews to gather insights that will guide product design. Your work will directly impact the user experience of our products and help us create intuitive and valuable features.",
    "responsibilities": "Plan and execute user studies, usability tests, and focus groups; synthesize qualitative and quantitative data to generate actionable insights; collaborate with product managers and designers to define research goals and objectives; provide feedback and recommendations for product improvements based on research findings; analyze user behaviors and interactions to identify pain points and opportunities.",
    "qualifications": "Experience in user research methods and usability testing; strong analytical skills and ability to synthesize data into actionable insights; familiarity with user research tools (e.g., UserTesting, Optimal Workshop); excellent communication and presentation skills; ability to collaborate with cross-functional teams.",
    "additionalInfo": "This is a hybrid remote role with occasional travel for user research. Quanta Labs is committed to building an inclusive, innovative team and providing opportunities for professional growth.",
    "postedDate": "2025-10-09"
  }
  ,
  {
    "id": "job-016",
    "title": "Platform Reliability Engineer",
    "company": "Aster Labs",
    "location": "San Francisco, CA",
    "experience": "Senior-Level",
    "employmentType": "Full-Time",
    "salary": "$150,000 - $185,000",
    "remote": false,
    "visaTypes": ["H-1B", "L-1"],
    "shortDescription": "Ensure platform reliability and incident response.",
    "description": "Join Aster Labs' reliability team to lead incident response, build reliability tooling, and improve SLOs across the platform. Work closely with product and infrastructure teams to drive high-availability engineering practices and automate recovery patterns.",
    "responsibilities": "Lead incident response; design reliability tooling and runbooks; own SLO/SLI definition and reporting; automate recovery and observability; mentor on-call rotations.",
    "qualifications": "5+ years in SRE/Platform roles; strong systems knowledge; experience with observability tooling; cloud infrastructure experience.",
    "additionalInfo": "On-call rotation required; strong cross-team collaboration.",
    "postedDate": "2025-10-14"
  },
  {
    "id": "job-017",
    "title": "Senior Visual Designer",
    "company": "BluePeak",
    "location": "New York, NY",
    "experience": "Senior-Level",
    "employmentType": "Full-Time",
    "salary": "$95,000 - $120,000",
    "remote": true,
    "visaTypes": ["H-1B"],
    "shortDescription": "Lead visual design across web and marketing channels.",
    "description": "BluePeak is hiring a Senior Visual Designer to elevate product and brand experiences across digital channels. You will influence brand identity, marketing creative, and product surfaces while mentoring junior designers.",
    "responsibilities": "Create high-fidelity visuals; lead brand initiatives; mentor designers; collaborate with marketing and product.",
    "qualifications": "Strong portfolio; 4+ years experience; expert in Figma and visual systems.",
    "additionalInfo": "Flexible remote work and design-led culture.",
    "postedDate": "2025-10-16"
  },
  {
    "id": "job-018",
    "title": "Machine Learning Engineer",
    "company": "Cortex Analytics",
    "location": "Seattle, WA",
    "experience": "Senior-Level",
    "employmentType": "Full-Time",
    "salary": "$140,000 - $170,000",
    "remote": true,
    "visaTypes": ["H-1B", "O-1"],
    "shortDescription": "Productionize ML models and pipelines.",
    "description": "Drive ML model deployment, monitoring, and lifecycle management at Cortex Analytics. Partner with data engineering to productionize models and ensure scalability and reproducibility.",
    "responsibilities": "Build model serving infrastructure; create monitoring for model drift; optimize inference pipelines; collaborate with data scientists.",
    "qualifications": "Experience deploying ML at scale; knowledge of TensorFlow/PyTorch; familiarity with Kubernetes and model serving frameworks.",
    "additionalInfo": "Competitive benefits and remote-friendly.",
    "postedDate": "2025-10-12"
  },
  {
    "id": "job-019",
    "title": "Frontend Engineer (React)",
    "company": "DeltaWorks",
    "location": "Austin, TX",
    "experience": "Mid-Level",
    "employmentType": "Full-Time",
    "salary": "$115,000 - $135,000",
    "remote": true,
    "visaTypes": ["H-1B"],
    "shortDescription": "Build performant React applications.",
    "description": "Work on modern React applications delivering product experiences for DeltaWorks. Optimize for performance, accessibility, and maintainability.",
    "responsibilities": "Develop features in React; follow best practices; collaborate with designers; write tests.",
    "qualifications": "3+ years React experience; strong JavaScript and CSS skills.",
    "additionalInfo": "Remote-first team with occasional meetups.",
    "postedDate": "2025-10-18"
  },
  {
    "id": "job-020",
    "title": "Content Strategist",
    "company": "Evergreen Media",
    "location": "Remote",
    "experience": "Mid-Level",
    "employmentType": "Full-Time",
    "salary": "$60,000 - $75,000",
    "remote": true,
    "visaTypes": ["OPT"],
    "shortDescription": "Plan and scale content for multi-channel marketing.",
    "description": "Lead content strategy to scale Evergreen Media's content production and drive engagement across platforms. Coordinate with creative and analytics teams to measure impact.",
    "responsibilities": "Define content calendars; measure performance; manage content contributors; optimize SEO.",
    "qualifications": "Experience in content strategy and analytics; strong writing skills.",
    "additionalInfo": "Flexible schedule.",
    "postedDate": "2025-10-20"
  },
  {
    "id": "job-021",
    "title": "Site Reliability Engineer",
    "company": "Flux Infrastructure",
    "location": "Boston, MA",
    "experience": "Senior-Level",
    "employmentType": "Full-Time",
    "salary": "$130,000 - $160,000",
    "remote": false,
    "visaTypes": ["H-1B", "L-1"],
    "shortDescription": "Ensure uptime and scalability for core services.",
    "description": "Responsible for reliability of cloud services, capacity planning, and automating operational tasks. Work with engineering teams to reduce toil and improve deployment systems.",
    "responsibilities": "Capacity planning; automation; incident response; runbooks and on-call support.",
    "qualifications": "Experience with Kubernetes, Terraform, and cloud ops.",
    "additionalInfo": "On-site collaboration expected.",
    "postedDate": "2025-10-22"
  },
  {
    "id": "job-022",
    "title": "Android Engineer",
    "company": "Greenfield Apps",
    "location": "San Diego, CA",
    "experience": "Mid-Level",
    "employmentType": "Full-Time",
    "salary": "$110,000 - $130,000",
    "remote": false,
    "visaTypes": ["H-1B"],
    "shortDescription": "Build native Android apps with Kotlin.",
    "description": "Develop and maintain Android applications with a focus on performance and user experience. Collaborate with cross-functional teams to ship high-quality mobile features.",
    "responsibilities": "Implement features; optimize performance; write tests; participate in code reviews.",
    "qualifications": "Experience with Kotlin, Android SDK, Jetpack libraries.",
    "additionalInfo": "Mobile-first product with frequent releases.",
    "postedDate": "2025-10-24"
  },
  {
    "id": "job-023",
    "title": "Customer Support Specialist",
    "company": "Halo Systems",
    "location": "Chicago, IL",
    "experience": "Entry-Level",
    "employmentType": "Full-Time",
    "salary": "$50,000 - $60,000",
    "remote": true,
    "visaTypes": ["OPT"],
    "shortDescription": "Provide technical support to customers.",
    "description": "Help customers adopt Halo Systems' product and troubleshoot technical issues. Collaborate with engineering to resolve product gaps.",
    "responsibilities": "Support tickets; onboarding; documentation; escalate technical issues.",
    "qualifications": "Customer-facing experience; technical aptitude.",
    "additionalInfo": "Remote role with flexible hours.",
    "postedDate": "2025-10-26"
  },
  {
    "id": "job-024",
    "title": "Automation QA Engineer",
    "company": "Ionix QA",
    "location": "Denver, CO",
    "experience": "Mid-Level",
    "employmentType": "Full-Time",
    "salary": "$80,000 - $95,000",
    "remote": false,
    "visaTypes": ["H-1B"],
    "shortDescription": "Implement automated test frameworks.",
    "description": "Design scalable automated test frameworks and integrate them into CI to ensure product quality. Work closely with development teams to create reliable test coverage.",
    "responsibilities": "Build automation frameworks; CI integration; maintain test suites; mentor testers.",
    "qualifications": "Experience with Cypress, Selenium, or equivalent; coding skills for test automation.",
    "additionalInfo": "Opportunity to lead QA initiatives.",
    "postedDate": "2025-10-28"
  },
  {
    "id": "job-025",
    "title": "Associate Data Analyst",
    "company": "Kite Insights",
    "location": "Philadelphia, PA",
    "experience": "Entry-Level",
    "employmentType": "Contract",
    "salary": "$35/hr",
    "remote": true,
    "visaTypes": ["OPT", "CPT"],
    "shortDescription": "Support research and data analysis tasks.",
    "description": "Collect and analyze market data to support client deliverables, build dashboards, and support senior analysts.",
    "responsibilities": "Data collection; preliminary analysis; create visualizations; support reporting.",
    "qualifications": "Familiarity with Excel, SQL, and visualization tools.",
    "additionalInfo": "Contract position with potential for extension.",
    "postedDate": "2025-10-29"
  },
  {
    "id": "job-026",
    "title": "Go Backend Engineer",
    "company": "LambdaWorks",
    "location": "Raleigh, NC",
    "experience": "Mid-Level",
    "employmentType": "Full-Time",
    "salary": "$120,000 - $140,000",
    "remote": false,
    "visaTypes": ["H-1B"],
    "shortDescription": "Build microservices in Go.",
    "description": "Contribute to LambdaWorks' microservice architecture, implement services in Go, and improve system reliability and performance.",
    "responsibilities": "Service development; code reviews; performance tuning; collaborate with teams.",
    "qualifications": "Go experience; microservices background.",
    "additionalInfo": "On-site engineering teams and mentorship.",
    "postedDate": "2025-11-01"
  },
  {
    "id": "job-027",
    "title": "Benefits Coordinator",
    "company": "Nova HR",
    "location": "Portland, OR",
    "experience": "Entry-Level",
    "employmentType": "Full-Time",
    "salary": "$55,000 - $65,000",
    "remote": false,
    "visaTypes": ["H-1B", "OPT"],
    "shortDescription": "Administer employee benefits programs.",
    "description": "Support benefits enrollment, vendor management, and employee communications for Nova HR clients.",
    "responsibilities": "Benefits admin; vendor coordination; employee support; compliance.",
    "qualifications": "HR experience a plus; attention to detail.",
    "additionalInfo": "Client-facing work with growth opportunity.",
    "postedDate": "2025-11-02"
  },
  {
    "id": "job-028",
    "title": "API Documentation Writer",
    "company": "Orbit Docs",
    "location": "Remote",
    "experience": "Mid-Level",
    "employmentType": "Contract",
    "salary": "$50/hr",
    "remote": true,
    "visaTypes": ["OPT"],
    "shortDescription": "Document APIs and SDKs for developer adoption.",
    "description": "Work with engineering teams to create clear API docs, SDK guides, and migration tutorials.",
    "responsibilities": "Write docs; create samples; maintain changelogs; ensure clarity and correctness.",
    "qualifications": "Technical writing experience; familiarity with API tools.",
    "additionalInfo": "Remote contract role.",
    "postedDate": "2025-11-03"
  },
  {
    "id": "job-029",
    "title": "Big Data Engineer",
    "company": "Pioneer Data",
    "location": "Atlanta, GA",
    "experience": "Senior-Level",
    "employmentType": "Full-Time",
    "salary": "$130,000 - $155,000",
    "remote": false,
    "visaTypes": ["H-1B"],
    "shortDescription": "Architect large-scale data systems.",
    "description": "Lead the design of data platforms and pipelines that support large-scale analytics workloads and reporting.",
    "responsibilities": "Architect data platforms; lead migrations; optimize ETL; mentor team.",
    "qualifications": "Experience with Spark, Kafka, and cloud data platforms.",
    "additionalInfo": "Leadership-focused role.",
    "postedDate": "2025-11-04"
  },
  {
    "id": "job-030",
    "title": "Senior UX Researcher",
    "company": "Quanta Labs",
    "location": "Los Angeles, CA",
    "experience": "Senior-Level",
    "employmentType": "Full-Time",
    "salary": "$115,000 - $140,000",
    "remote": true,
    "visaTypes": ["H-1B", "OPT"],
    "shortDescription": "Lead generative and evaluative research at scale.",
    "description": "Design and run large-scale research programs to inform product strategy and user experience across multiple product lines.",
    "responsibilities": "Research program design; synthesize insights; influence product roadmaps; mentor researchers.",
    "qualifications": "Proven research leadership and mixed-methods experience.",
    "additionalInfo": "Remote with periodic in-person workshops.",
    "postedDate": "2025-11-06"
  },
  {
    "id": "job-031",
    "title": "Junior Frontend Engineer",
    "company": "Aster Labs",
    "location": "San Francisco, CA",
    "experience": "Entry-Level",
    "employmentType": "Full-Time",
    "salary": "$85,000 - $100,000",
    "remote": false,
    "visaTypes": ["OPT", "CPT"],
    "shortDescription": "Contribute to web UI development using React.",
    "description": "Support the frontend team building UI components and features; good opportunity for growth under senior mentors.",
    "responsibilities": "Implement UI components; fix bugs; write tests; participate in design reviews.",
    "qualifications": "Familiarity with JavaScript and React; eagerness to learn.",
    "additionalInfo": "Great mentorship program for new grads.",
    "postedDate": "2025-11-07"
  },
  {
    "id": "job-032",
    "title": "Growth Marketing Manager",
    "company": "BluePeak",
    "location": "New York, NY",
    "experience": "Mid-Level",
    "employmentType": "Full-Time",
    "salary": "$95,000 - $115,000",
    "remote": true,
    "visaTypes": ["H-1B"],
    "shortDescription": "Drive acquisition and growth campaigns.",
    "description": "Lead performance marketing experiments to grow user acquisition and activation across channels.",
    "responsibilities": "Run growth experiments; manage channels; optimize funnels; analyze data.",
    "qualifications": "Experience with paid acquisition and analytics tools.",
    "additionalInfo": "Remote-friendly role.",
    "postedDate": "2025-11-08"
  },
  {
    "id": "job-033",
    "title": "NLP Researcher",
    "company": "Cortex Analytics",
    "location": "Seattle, WA",
    "experience": "Senior-Level",
    "employmentType": "Full-Time",
    "salary": "$145,000 - $175,000",
    "remote": true,
    "visaTypes": ["H-1B", "O-1"],
    "shortDescription": "Advance NLP models for enterprise use.",
    "description": "Work on cutting-edge NLP problems applied to enterprise data, building production-ready models and pipelines.",
    "responsibilities": "Research modeling approaches; productionize models; collaborate with product teams.",
    "qualifications": "PhD or strong research background preferred; publications a plus.",
    "additionalInfo": "Competitive comp and research budget.",
    "postedDate": "2025-11-09"
  },
  {
    "id": "job-034",
    "title": "Product Manager",
    "company": "DeltaWorks",
    "location": "Austin, TX",
    "experience": "Mid-Level",
    "employmentType": "Full-Time",
    "salary": "$110,000 - $130,000",
    "remote": true,
    "visaTypes": ["H-1B"],
    "shortDescription": "Own feature delivery and product outcomes.",
    "description": "Lead cross-functional teams to define and launch product features that drive engagement and retention.",
    "responsibilities": "Roadmap ownership; define metrics; work with engineering and design; prioritize backlog.",
    "qualifications": "Product experience with SaaS or consumer products.",
    "additionalInfo": "Remote-first organization.",
    "postedDate": "2025-11-10"
  },
  {
    "id": "job-035",
    "title": "Senior Copywriter",
    "company": "Evergreen Media",
    "location": "Remote",
    "experience": "Senior-Level",
    "employmentType": "Full-Time",
    "salary": "$80,000 - $100,000",
    "remote": true,
    "visaTypes": ["OPT"],
    "shortDescription": "Create compelling marketing copy and content.",
    "description": "Develop high-quality marketing copy for campaigns, landing pages, and newsletters to drive engagement and conversions.",
    "responsibilities": "Write and edit copy; align messaging with brand; collaborate with design and analytics teams.",
    "qualifications": "Strong portfolio in marketing copy.",
    "additionalInfo": "Remote and flexible hours.",
    "postedDate": "2025-11-11"
  },
  {
    "id": "job-036",
    "title": "Cloud Security Engineer",
    "company": "Flux Infrastructure",
    "location": "Boston, MA",
    "experience": "Mid-Level",
    "employmentType": "Full-Time",
    "salary": "$120,000 - $145,000",
    "remote": false,
    "visaTypes": ["H-1B"],
    "shortDescription": "Harden cloud environments and perform security reviews.",
    "description": "Improve security posture, conduct threat modeling, and create secure architectures for cloud deployments.",
    "responsibilities": "Security reviews; implement controls; vulnerability management; incident response.",
    "qualifications": "Experience with cloud security, IAM, and compliance standards.",
    "additionalInfo": "Security certifications a plus.",
    "postedDate": "2025-11-12"
  },
  {
    "id": "job-037",
    "title": "Product Marketing Associate",
    "company": "Halo Systems",
    "location": "Chicago, IL",
    "experience": "Entry-Level",
    "employmentType": "Full-Time",
    "salary": "$55,000 - $68,000",
    "remote": true,
    "visaTypes": ["OPT"],
    "shortDescription": "Support go-to-market and product positioning.",
    "description": "Assist product marketing in messaging, launch plans, and competitive differentiation activities.",
    "responsibilities": "Launch support; create sales enablement materials; competitive research.",
    "qualifications": "Interest in product marketing and strong communication skills.",
    "additionalInfo": "Great role for early-career marketers.",
    "postedDate": "2025-11-13"
  },
  {
    "id": "job-038",
    "title": "Senior Test Automation Engineer",
    "company": "Ionix QA",
    "location": "Denver, CO",
    "experience": "Senior-Level",
    "employmentType": "Full-Time",
    "salary": "$95,000 - $120,000",
    "remote": false,
    "visaTypes": ["H-1B"],
    "shortDescription": "Lead automation strategy and frameworks.",
    "description": "Drive automation at scale across web and mobile platforms, building maintainable frameworks and mentorship tracks for QA engineers.",
    "responsibilities": "Strategy; framework design; CI integration; mentorship.",
    "qualifications": "Proven automation leadership; deep automation tooling expertise.",
    "additionalInfo": "Leadership opportunity with training budget.",
    "postedDate": "2025-11-14"
  },
  {
    "id": "job-039",
    "title": "Research Project Coordinator",
    "company": "Kite Insights",
    "location": "Philadelphia, PA",
    "experience": "Entry-Level",
    "employmentType": "Contract",
    "salary": "$38/hr",
    "remote": true,
    "visaTypes": ["OPT", "CPT"],
    "shortDescription": "Coordinate research projects and participant recruitment.",
    "description": "Support research operations including participant recruitment, scheduling, and data collection for market research studies.",
    "responsibilities": "Recruit participants; manage schedules; assist with data collection and reporting.",
    "qualifications": "Organized and detail-oriented; experience in research a plus.",
    "additionalInfo": "Contract with flexible scheduling.",
    "postedDate": "2025-11-15"
  },
  {
    "id": "job-040",
    "title": "Analytics Engineer",
    "company": "Pioneer Data",
    "location": "Atlanta, GA",
    "experience": "Mid-Level",
    "employmentType": "Full-Time",
    "salary": "$110,000 - $130,000",
    "remote": false,
    "visaTypes": ["H-1B"],
    "shortDescription": "Build analytics models and transform data for BI.",
    "description": "Transform raw data into analytics-ready models, build reusable datasets, and collaborate with analysts to deliver insights.",
    "responsibilities": "Data modeling; build dbt models; optimize warehouse performance; partner with analytics teams.",
    "qualifications": "Experience with dbt, SQL, and cloud warehouses (BigQuery/Redshift/Snowflake).",
    "additionalInfo": "Strong cross-functional collaboration and mentorship.",
    "postedDate": "2025-11-16"
  }
]
